# melt() â€” Wide to Long

In [2]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

In [3]:
df

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [5]:
# melt() -> converts the data from wider format to longer format
melted_df = df.melt(id_vars = "Name", value_vars = ["Math", "Science", "English"], 
                    var_name = "Subject", value_name = "Score")

In [6]:
melted_df

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [8]:
# pivot() -> converts the data from longer format to wider format
pivoted_df = melted_df.pivot(index = "Name", columns = "Subject", values = "Score")

In [9]:
pivoted_df

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89